app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("content", "author", "created_at", "updated_at") VALUES ('Cool site!', 'Bryan', '2025-02-20 18:08:07.096736', '2025-02-20 18:08:07.096736') RETURNING "id"